---
type: ColorSelectionDialog
namespace: Autodesk.Revit.UI
version: 2024
members: 6
tags: [revit-api, class]
---

# ColorSelectionDialog

`Autodesk.Revit.UI.ColorSelectionDialog` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ColorSelectionDialog | 2017 | `public ColorSelectionDialog ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Show | 2017 | `public ItemSelectionDialogResult Show ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OriginalColor | 2017 | `public Color OriginalColor { get ; set ; }` |
| Property | SelectedColor | 2017 | `public Color SelectedColor { get ; }` |